package Spring;

public class MyIntroduction {
    public static void main(String[] args) {

        //Введение

        /*
        Основной момент Spring
        . Создание объектов
        . Настройка взаимодействия (вне объектов)
        . Подключение дополнительных аспектов
         */

        /*
        Основной момент loC:
        . Сначало создаётся абстракция
        . Потом подставляете реализацию

        Контейнер:
        . Управляет зависимостями
        . Связывает объекты между собой
        . Управляет их жизненным циклом
        . Dependency Injection (Внедрение Зависимостей) - в объект внедряется ссылка на другой объект
         */

        /*
        Основные моменты AOP
        . Разделение основного функционала и дополнительного - без перемешивание их между собой
        . Кэширование, Логирование, Транзакция, Безопастность и пр.
        . Аспект - функциональность, не относящаяся напрямую к бизнес логике
        . Аспекты можно использовать в любых проектах
         */

        //Подготовка
        /*
        . Установка eclipse - среда разработка
        . Установка Maven - инструмент сборки
        . Установка Spring - core библиотеки
        . Создание проекта

         */
    }
}
